searchL <- list(
  c("동남아", "푸켓", "수영복", "유심", "패키지", "가족여행", "자유여행", "리조트", "베트남")
  , c("가족여행", "패키지", "유럽", "푸켓", "자유여행", "환율", "신혼여행", "신발사이즈표")
  , c("보라카이", "신혼여행", "날씨", "환율", "비행기표", "풀빌라", "시차")
  , c("패키지", "동남아", "가족여행", "휴양지", "여행지추천", "특가")
  , c("일본", "번역기", "후쿠오카", "온천", "가족여행", "리조트", "포켓와이파이")
  , c("몰디브", "신혼여행", "항공권", "동남아", "비행시간", "숙소", "비자", "발리", "풀빌라")
  , c("호텔", "동남아", "세부", "호핑투어", "리조트", "신혼여행", "풀빌라", "필리핀")
  , c("푸켓", "풀빌라", "여행", "신혼여행", "자유여행", "와이파이", "코타키나발루")
  , c("동남아", "보홀", "보라카이", "팔라완", "가족여행", "스쿠버다이빙", "여행책")
  , c("푸켓", "가족여행", "보라카이", "동남아", "스쿠버다이빙", "리조트", "피피섬")
  , c("배낭여행", "유럽", "호스텔", "북유럽", "서유럽", "파리", "루브르", "에투알", "에펠")
  , c("이탈리아", "베네치아", "토스카니", "피렌체", "바티칸", "여행지도")
  , c("하와이", "괌", "푸켓", "세부", "리조트", "가족여행", "골드카드")
  , c("괌", "푸켓", "세부", "호텔", "풀빌라", "가족여행", "힐튼", "쉐라톤")
  , c("베네치아", "피렌체", "신혼여행", "로마", "패키지")
  , c("배낭여행", "유럽", "호텔팩", "공항", "환율", "픽업서비스", "런던", "파리", "체코", "호스텔")
  , c("특가", "파리", "환율", "스위스", "이탈리아", "오스트리아", "와이파이", "호스텔")
  , c("지중해", "유럽", "특가", "배낭여행", "패키지", "파리", "스위스", "이탈리아", "오스트리아")
  , c("유럽", "동유럽", "날씨", "체코", "환율", "비엔나", "배낭여행", "부다페스트", "호스텔")
  , c("유심", "체코", "신혼여행", "크로아티아", "패키지", "비엔나", "류블랴냐", "독일", "동유럽", "부다페스트")
  , c("패키지", "지중해", "호텔", "유럽", "동유럽", "폴란드", "부다페스트", "신혼여행", "프라하", "크로아티아")
  , c("동유럽", "폴란드", "체코", "프라하", "독일", "크로아티아", "날씨")
  , c("이스탄불", "호스텔", "유럽", "자유여행", "배낭여행", "지중해", "날씨", "파묵칼레")
  , c("신혼여행", "이탈리아", "지중해", "날씨", "유럽", "자유여행", "와이파이", "유심")
  , c("이탈리아", "지중해", "산토리니", "아테네", "유럽", "터키")
  , c("유심", "터키", "유럽", "그리스", "지중해", "이탈리아")
  , c("배낭여행", "유심", "지중해", "아테네", "산토리니", "메테오라", "로마", "베네치아")
  , c("유럽", "날씨", "동유럽", "사진", "우산", "3박10일", "패키지")
)

str(searchL)
#벡터화
searchVec=unlist(searchL)
str(searchVec)
#빈도수
searchT = table(searchVec)
searchT
#top5
searchTsort=sort(searchT, decreasing = T)
searchTsort
searchTsort[1:5]

#sapply
#데이터 비교
"유렵" %in% '동유럽'
'유럽' %in% '유럽'
search.data=c('동유럽','유럽')
'유럽' %in% search.data

sapply(search.data, function(x){'유럽' %in% x})

idx=sapply(searchL, function(x){'유럽' %in% x})
searchEuropeL = searchL[idx]
str(searchEuropeL)


searchEuropeT = table(unlist(searchEuropeL))
searchEuropeT = sort(searchEuropeT, decreasing = T)
searchEuropeT[1:5]
